[
    "Car and driver are very good and good condition very clean very hyganic. Driver is very co operative thanks to drop off thivim station see you to next time",
    "Good service",
    "Fantastic",
    "simply the best",
    "Awesome Taxi Services!!! Thanks!! Fajardo Taxi",
    "Jimmy was wonderful! He picked us up in John o’Groats with trailer and drove us to Edinburgh. He was very helpful! It was a welcome sight as we had bags and bikes having just cycled from Land’s End! Thank you",
    "Service is very good 👍. I like your service.\n\r\nThanks",
    "I have been using the taxi transfers since 2016 and it has always been an Excellent service. 5 star rating from me.",
    "Great service, great driver would recommend and definitely use again",
    "I have been using Davidson Taxi Transfers for over seven years. Jimmy and Paul are consummate professionals. They are reliable, helpful and convivial. They go out of their way to help with organizing travel to and from the airport. Their consistently high level of service, competitive pricing, and reliability are the reasons I will continue to use them for trips to and from the airport and why I very strongly recommend Davidson Taxi Transfers.",
    "We have used Davidson Taxi Transfers for several years now for trips between St Andrews and Edinburgh airport. They are very reliable and user friendly with an easy to use online payment system. Their vehicles are comfortable and clean and cater for a range of passenger numbers.",
    "top professional service",
    "Booking and transfer were very efficient, very professional, and very friendly. A highly recommendable no-hassle way of getting from Edinburgh airport to St Andrews.",
    "Excellent taxi service",
    "I have used Davidsons Taxi on two visits to St. Andrews and have found them professional and responsible! They are on time and were very flexible with letting us shop in Dundee for the start of the University year and suggested places for all the items needed to get a new international student settled! I will certainly use them in the future!",
    "Fantastic service by Davidson taxi transfers. As a first time customer I will definately use again.  Paul was waiting for us on arrival and was very prompt. Handy extras such as phone chargers, heated seats etc. Couldn't have expected better :)",
    "As a first time customer to Davidson Taxi's after a referral, I was not disappointed. First class service from start to finish and my guest to Dundee who I booked this service was was also very complimentary. Thank you so much for all your help and I would highly recommend this service to anyone looking for a transfer or airport pickup. Kind regards Sharon",
    "Ontime courteous service + perfectly adequate car + responsible driving = good value.",
    "Davidson Taxi did a wonderful job for us! They were most considerate in helping arrange transfer service for our daughter to attend St. Andrews University.  All arrangements and payment were handled on line which aided us tremendously in making reservations and payments from the US.  \r\nThe pick up was on time and very friendly and helpful. \r\nGreat job and we look forward to you helping us again in the future.\r\nD Franck",
    "very good service",
    "I personally tried their service last Saturday, and it was perfect. \n\r\nMoreover, I am into the same field, and providing taxi service in Mumbai and Pune (India). Thus, I believe that, my observation is more accurate than others.",
    "I cant recomend Davidson Taxi Transfers enough. We contacted them last minute to arrange a pick up for our large party on return home from our holiday. Paul and Jim were able to assist us at such short notice and greeted us on time with a trailer to transport our large amount of luggage home. We enjoyed a friendly chat on the way which made the last part of our long journey fly in.Thanks again guys!!",
    "Jim and Paul provided transport for the entire week and we received excellent service. They readily accommodated every change in pickup when required and were always punctual.\n\r\nThey were also very friendly and courteous and were helpful in recommending restaurants etc.",
    "Indeed very pleasant journey :-)",
    "Dear Jimmy & Paul,\n\r\nThank you for the many transfers from the Edinburgh airport to our daughter's school in St Andrews and back in the last two years. For my husband, my mother, our daughter, our whole family, me, on many different occasions. You were always there in time and drove us to our destination smooth and safe. Hopefully we will visit St Andrews again in the near future, surely I will give you a call!\r\nAll the best, \n\r\nAnneloes",
    "David kuzniar was good, had a great attitude. I give him a 5 star",
    "We used Jimmy and Paul to collect us at and return us to EDI and for two other trips locally.  They were on time, prepared, courteous and easy to reach by phone.  We would use them again, exclusively on our next trip.  A St Andrews friend referred me to them and I thanked him for such a good tip.",
    "Paul, from Davidson Taxis collected us from outside Edinburgh Waverley station in sleet and freezing temps last week. He arrived exactly when he said he would, quickly loaded our cases and got us to our destination before the weather worsened and the roads were closed the next day by snow. \r\nPaul was the most pleasant and interesting driver and his tales of his parrot’s antics will remain with us all!! We needed something to lift our mood as we were travelling for a work event and the weather was closing in. Paul could easily have driven and said nothing, he would still have been a good taxi driver. As it was he lifted our spirits and we all agreed we wanted to use him for the return journey. His colleague who we booked with was great on the phone. The firm came highly recommended and now we know why. Thank you Paul, Jimmy and Derek!",
    "Great service----very helpful.",
    "We could not have hoped for a better and more patient driver than Paul. Paul was able to provide a child safety seat for a three-year-old passenger and ensured a friendly welcome despite the delayed flight. When the child got travel-sick, he was extremely kind and helpful. This was outstanding service both from and to Edinburgh airport.",
    "Brilliant service - on time, very helpful, reliable & trustworthy.  We will definitely be using them again.  Well done!",
    "Thank you for such a smooth pick up & drop off last week, we really appreciated it Jimmy!",
    "Davidson Taxi Transfers were extremely useful in providing transport for our event. The process of organising the taxis was quick and efficient, all staff were very helpful throughout the whole process. The taxis arrived as planned on the evening of the event, and I was very impressed with the service that they provided to our guests. I would definitely use Davidson Taxi Transfers when organising future events, as they have been fantastic all the way through the process.",
    "I cannot tell you just how good this firm is. I rang on a Sunday evening to see if there was any way they could collect our daughter from Edinburgh airport to take her back to St Andrews. They went out of their way to provide a taxi, her plane was 30 mins late and they were able to accommodate that. The driver waited in arrivals inside rather than my daughter having to find him in the car park in the dark. It was an absolutely first class service. We’d not used them before but certainly will from now on. On top of being really helpful they were also extremely friendly! Cannot recommend highly enough. \r\nPenny",
    "Wouldn't go anywhere else for Airport transfer/ taxi service. Davidson's Taxi Transfer (Jimmy & co) is excellent and very reliable, 100% customer focus, very friendly, great price, never lets you down, even at last minute arrangement/travel/pick-up/drop-off, you will always get transfer/driver. Highly recommended #VIPTransfers",
    "This is the second time we have used a taxi to ferry workers from Edinburgh Airport to our farm and would recommend the service to anyone, whether business or personal, as we are very happy with it!  We will continue to use this service in the future.",
    "great on time service.  paul is a great person with all the information you need for your holiday.  highly recommend",
    "very nice transfers to and back from st andrews to edinburgh airport. excellent service and driver, will do the utmost to help you. would recommend 200%.",
    "I appreciate the efficiency and wonderful customer services of Davidson Taxi. The driver was very helpful and friendly. I will certainly use their taxi transfer services again in the future.",
    "Thank you for an fantastic service you provide us! \r\nIt started when Paul welcomed us at the Edinburgh airport with a smile even we where 3 hours delayed. \r\nYou made our trip to St Andrews and Carnoustie flawless! \r\nI will recommend you to all my friends if they heading to St Andrews in the future.",
    "Thank you for the very nice service!",
    "Great service, we were absolutely happy and I was amazed with the patience and professionalism of your driver. You have made the beginning of our trip to Scotland very nice with warm welcome, thank you for that!",
    "Davidson Taxi service never fails to go above and beyond with their customer service. I have gotten through many tough travel plans thanks to Davidson Taxis! They are always my number one choice and I wouldn't hesitate to recommend them for service and value! Thank you, Davidson Taxis!",
    "We would like to thank you very much for our journey to Edinburgh Airport, it was most enjoyable and the driver was fantastic. 5 stars to your driver and company",
    "I would like to thank you for waiting for me at Edinburgh airport yesterday at 02.00+ in the morning and for providing a safe and comfortable drive back to Dundee. Very much appreciated.",
    "Taxi service and Drivers are always courteous and punctual. Cannot fault them at all. No matter what time my flights are nothing is a problem.",
    "Excellent service, reliable and responsive. Thank you",
    "Thank you very much for being punctual and so on, we will see you again in April.",
    "The service we received from you was excellent!  Thank you very much.  We will certainly use Davidsons again in the future.",
    "The driver was excellent. He arrived early, which I appreciated, and throughout the travel I felt entirely safe, which may not necessarily said for all taxi drives.\r\nI will recommend your service to any colleagues who may be of need of your services when in Dundee.\n\r\nBest wishes, Jannet",
    "The ride was smooth and fast, the driver was in the arrival hall at EDI when we came and in the hotel parking lot ahead of time for our return journey and we were all very pleased  with your services !",
    "Thank you once again for your fantastic service - it was a pleasure using your services.",
    "Best customer service I've had in ages. Always so kind and accommodating on the phone, and there is nothing like getting off a plane and being greeted by a smiley face!",
    "Great service ! Very punctual and efficient",
    "Great service, can deffo recommend you to any others requiring taxi transfers!",
    "Thank you so much for the excellent taxi service and for so kindly informing us of the flight delay. Kind regards and best wishes to all for a happy Christmas.",
    "Have been very impressed with Davidson taxi in recent weeks, as they have helped us organize a number of trips to and from EDI. Prompt, courteous, and very accommodating! I would definitely use them again!",
    "Friendly, efficient, reliable; cars comfortable and in good nick; highly recommended.",
    "Excellent service: they called me the evening before my 4am taxi, and they even managed to find someone to share the taxi with. Very good and smooth driver with a positive attitude. I highly recommend them.",
    "Thank you to \"The Customer Service Team\" for all your help for not only arranging the taxi for my Mum but also for keeping us up to date that she was at the airport and when she was dropped home. Also to Brian the driver who was so very nice to her during the journey and helped her at both ends......you were all terrific.....thank you !",
    "Great service! Brian was there on time and and was a very friendly driver. Thank you also to Jim for organising my booking so efficiently even though I only contacted two days in advance. I appreciated the prompt replies while we were corresponding. And finally, you charged a very good rate! Cheers",
    "Thanks guys, as always our transfer from Edinburgh airport was first class. All the best, glad to know the team & the service is just the same! see you next month. Sonia and family.",
    "I had a lovely stay in St. Andrews – too bad it was not for longer. Please thank Kevin again for us – the traffic was quite bad (due to the annual Highland Show) and I'm sorry that he had to deal with it, but he did get us there in plenty of time. Thank you also for suggesting the earlier pick-up time – which we certainly needed. Best regards,\r\nAndy",
    "Thanks! Very interesting site!",
    "Very professional service,  incredibly responsive and quite affordable. Recently requested copies of receipts for travel from 10 months ago and had a response in under an hour! Great customer service, wish we had service like this in London!",
    "Excellent friendly service, extremely helpful when I accidentally left a briefcase after being dropped at the airport. Thank you",
    "fantastic service . The taxi driver was very efficient at trying to locate the missing clients in order to not delay us too much . good driver and good time made. smooth booking.",
    "We contacted Jim because we were planning\r\na week in St Andrews and didn't want to rent a car. He arranged for us to receive a 10% discount on all trips and all the drivers were a really friendly and helpful crowd of people. I would recommend them.",
    "Thanks again to the team for your great customer service. From the reservation to arriving at our destination your team was fabulous. We appreciate you!",
    "Hi Jim, thanks for the taxi transfer from Edinburgh airport last week. Everything went smoothly, the driver was very professional and friendly!",
    "Excellent service; communication was prompt and it was easy to arrange a pickup. The driver was friendly and helpful. Thanks guys!",
    "I have now had the pleasure of using services twice on my visit to St. Andrew’s and on both occasions found them to be very professional, energetic, and reliable. Their web-site is easy to use, they make every effort to fulfill share requests, and keep you well informed leading up to the day of services. I will definitely use them in the future and will highly recommend them to family and friends. Thanks for all that you do!",
    "We have the same duty and if there is a chance to Bangkok. Please visit us.\r\nGreat!",
    "hello.\r\nThank you very much for your service and help.\r\nthat was very safe journey for sure.\r\nthanks once again.",
    "we like your service :) thank you!!!",
    "Used for the first time today and received excellent, corteous and friendly service, can highly recommend and will certainly use again.",
    "The transfer was GREAT as usual!!!! \r\nThe driver was also very nice, convenient and helpful!\n\n",
    "My parents were really happy.They told me they had a lovely, informative, engaging driver. We're all very happy! \n",
    "Thank you for the transfer to the airport! Everything worked very well!\n\n"
]